/*描述
计算“百元买百鸡”的问题，用一百元钱买一百只鸡。已知公鸡每只5元，母鸡每只3元，小鸡1元买3只，试问公鸡、母鸡、小鸡各买了多少只。
输出
输出所有结果，按照每一行公鸡x只，母鸡y只，小鸡z只的形式输出，如样例输出所示
公鸡x只，母鸡y只，小鸡z只
公鸡a只，母鸡b只，小鸡c只
*/

#include <stdio.h>

int main() {
    for (size_t i = 0; i < 21; i++)
    {
        for (size_t j = 0; j < 33; j++)
        {
            if (i*5 + j*3 <= 100 && (i+j)*1 <= 100)
            {
                if(i + j + (100-i*5-j*3)*3 == 100){
                    printf("公鸡%d只，母鸡%d只，小鸡%d只\n", i, j, (100-i*5-j*3)*3);
                }
            }
            
        }
        
    }
    
    return 0;
}